You need to create a network for this (unless `br0` already existed on your machine). I used this config:

```
provider "libvirt" {
  uri = "qemu+unix:///system"
}

resource "libvirt_domain" "jenkinsn" {
  name      = "jenkinsn"

  vcpu    = 4
  memory  = 8192
                                                                                                                                                                                                                   
  network_interface {
    bridge = "${libvirt_network.net.bridge}"
    mac = "48:f1:7f:79:ea:73"
  }
}

resource "libvirt_network" "net" {
  name = "brt0"

  mode   = "bridge"
  bridge = "brt0"
}
```

and was able to create the net, bridge and the domain appropriately:

```
$ terraform apply
...
Terraform will perform the following actions:

  # libvirt_domain.jenkinsn will be created
  + resource "libvirt_domain" "jenkinsn" {
      + arch       = (known after apply)
      + emulator   = (known after apply)
      + id         = (known after apply)
      + machine    = (known after apply)
      + memory     = 8192
      + name       = "jenkinsn"
      + qemu_agent = false
      + running    = true
      + vcpu       = 4

      + network_interface {
          + addresses    = (known after apply)
          + bridge       = "brt0"
          + hostname     = (known after apply)
          + mac          = "48:f1:7f:79:ea:73"
          + network_id   = (known after apply)
          + network_name = (known after apply)
        }
    }

  # libvirt_network.net will be created
  + resource "libvirt_network" "net" {
      + bridge = "brt0"
      + id     = (known after apply)
      + mode   = "bridge"
      + name   = "brt0"
    }
...

$ sudo virsh net-dumpxml brt0
<network>
  <name>brt0</name>
  <uuid>88238877-b432-4874-b7ca-4ab096657f65</uuid>
  <bridge name='brt0' stp='on' delay='0'/>
  <mac address='52:54:00:80:7a:51'/>
</network>

$ sudo virsh dumpxml jenkinsn
<domain type='kvm' id='22'>
  <name>jenkinsn</name>
  <uuid>a37aeeff-b91d-487d-b339-945afed4f72e</uuid>
...
    <interface type='bridge'>
      <mac address='48:f1:7f:79:ea:73'/>
      <source bridge='brt0'/>
      <target dev='vnet0'/>
      <model type='virtio'/>
      <alias name='net0'/>
      <address type='pci' domain='0x0000' bus='0x00' slot='0x03' function='0x0'/>
    </interface>
...
</domain>
```

Isn't this what you need/want @lifeofguenter ?